#+TITLE: Freerun
#+AUTHOR: Chris Maiorana

* Shell Code Examples
  :PROPERTIES:
  :HEADER-ARGS: :results raw
  :ID:       DFB1183D-CC79-480B-AB1B-F14092DC77CB
  :END:

For demonstration purposes, this following code block allows for shell
commands.  No tangle argument here, any shell commands that you run
from here will not affect the theme files.  However, a "results"
argument with parameter "raw" will echo the raw output in the buffer.

Add [[https://phpunit.readthedocs.io/en/9.3/][PHPUnit]] to your project using Composer (may take a minute or so):

#+BEGIN_SRC shell
/usr/local/bin/composer require --dev phpunit/phpunit ^9
#+END_SRC

#+RESULTS:

Get the version:

#+BEGIN_SRC shell
./vendor/bin/phpunit --version
#+END_SRC

#+RESULTS:
PHPUnit 9.3.7 by Sebastian Bergmann and contributors.
